anthropic.claude-code
astro-build.astro-vscode
bradlc.vscode-tailwindcss
bruno-api-client.bruno
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
dustypomerleau.rust-syntax
eamodio.gitlens
esbenp.prettier-vscode
fwcd.kotlin
github.copilot-chat
github.github-vscode-theme
google.gemini-cli-vscode-ide-companion
jdinhlife.gruvbox
meganrogge.template-string-converter
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.vscode-typescript-next
njpwerner.autodocstring
redhat.vscode-yaml
rust-lang.rust-analyzer
tamasfe.even-better-toml
usernamehw.errorlens
vscjava.vscode-gradle
yoavbls.pretty-ts-errors
