astro-build.astro-vscode
biomejs.biome
bradlc.vscode-tailwindcss
bruno-api-client.bruno
charliermarsh.ruff
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
jdinhlife.gruvbox
mermaidchart.vscode-mermaid-chart
midudev.better-svg
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
njpwerner.autodocstring
qwtel.sqlite-viewer
rust-lang.rust-analyzer
svelte.svelte-vscode
tauri-apps.tauri-vscode
tomoki1207.pdf
yoavbls.pretty-ts-errors
