tap "denisidoro/tools"
tap "mongodb/brew"
tap "steipete/tap"
brew "ncurses"
brew "bash"
brew "colima"
brew "coreutils"
brew "docker"
brew "findutils"
brew "fswatch"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "hyperfine"
brew "make"
brew "mas"
brew "mongocli"
brew "python@3.14"
brew "mpv"
brew "node", link: false
brew "nvm"
brew "pipx"
brew "pnpm"
brew "pyenv"
brew "rtk"
brew "tlrc"
brew "tree"
brew "uv"
brew "zsh"
brew "zsh-autosuggestions"
brew "denisidoro/tools/docpars"
brew "mongodb/brew/mongodb-database-tools"
cask "steipete/tap/codexbar"
mas "Numbers", id: 409203825
mas "WhatsApp", id: 310633997
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "jdinhlife.gruvbox"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "yoavbls.pretty-ts-errors"
